<template>
	<view style="position: relative;">
		<view class="title">房东服务协议</view>
		<view class="xieyi">
			<text>
				{{xieyi}}
			</text>
		</view>
		<view class="button">
			<evan-checkbox v-model="checked">同意《协议》</evan-checkbox>
		</view>
		<button style="width: 90%;margin: 10upx auto;background: #007AFF;color: #F7F7FA;border-radius: 10upx;" @click="fabu">点击发布房源</button>
	</view>
</template>

<script>
	import EvanCheckbox from '../../components/evan-checkbox/evan-checkbox.vue'
	export default {

		data() {
			return {
				xieyi: `作为房东，使用“凉安租房”服务前，您承诺接受并遵守本协议的约定。如您不同意本协议的约定，您应立即停止注册程序或停止使用“凉安租房”服务。您应当在使用“凉安租房”服务之前认真阅读本协议内容，因为它包含了关于您在凉安租房如何代收房费的结算以及取消订单等重要内容，您使用“凉安租房”服务的行为即视为您与“凉安租房”缔结本协议，本协议即对您产生约束。另请阅读“凉安租房”平台上发布的其他政策，这些政策同样适用于房东对凉安租房平台的使用。
				第一条 平台使用
				房东应当是年满十八周岁且具备完全民事行为能力的自然人或完全独立具备签署、履行本协议的权利能力和行为能力法人、社会团体或其他组织，如您不符合上述条件，“凉安租房”有权拒绝或终止向您提供服务，并解除本协议，由此给“凉安租房”、房客及您自身造成的损失将由您自行承担。
				为了履行本协议，您必须首先注册一个凉安租房账户。您应对前述账户的密码安全，以及对通过您的前述账户实施的行为承担全部责任。

				您在“凉安租房”获取房客信息后，应当在“凉安租房”平台进行交易，如您将上述交易转移至线下进行或转移至其他平台进行交易的，凉安租房有权不经通知直接对您在“凉安租房”平台上的全部或部分房源房源信息进行修改或删除直至关闭您的房东房源信息发布功能、暂时或永久关闭您的账户。

				第二条 房源发布与维护
				发布房源前，您应当已经依法取得所发布房源的房屋所有权或合法转租权，并应向“凉安租房”提供相关法律证明文件，包括但不限于身份证明、营业执照、房屋产所有权证、购房协议与发票、租赁协议、使用协议、经营资质等，并保证所提供的法律证明文件真实、有效。如您未能提供上述证明文件的，“凉安租房”有权拒绝发布房源。

				发布房源时，您需按照《凉安租房品质审核标准》填写房源相关信息。房源信息应当真实，面积应当表明为建筑面积或者套内建筑面积；房源标题、房源描述以及周边介绍中不得出现新《广告法》禁用词汇，绝对化、夸张、无法准确定义和衡量的词汇。例如“最”、“第一”、“首家”、“独家”、“领先”、“王牌”、“完美”、“臻品”、“精装”、“高端”、“大约/左右”、“xx分钟到达”、“应有尽有”、“齐全”、“毗邻”、“紧挨着”、“零距离”等。

				您在“凉安租房”平台上发布的房源信息（包括但不限于房源地址，居室数量，设施配备，可居住人数等）均应真实可信，符合凉安租房规则的要求，不得含有虚假或者引人误解的内容，不得含有与租赁房屋无关的信息，不得未经“凉安租房”允许在“凉安租房”网站上进行商业广告行为，不侵犯任何第三人的合法权利，或有其他被“凉安租房”视为不适当的行为。“凉安租房”有权对房东发布的房源信息进行管理，一旦发现或被人举报个人房东发布的房源信息存在违法违规、有虚假或引人误解的内容或表述不准确、不清楚、不明白的内容，有权通知房东进行删除或修改，紧急情况下，“凉安租房”有权不经通知直接对房源信息进行删除或修改直至关闭房源信息发布。
				因您提供虚假或不准确的信息导致房客无法正常预订、入住或投诉或给“凉安租房”和/或房客造成损失的，您应当承担相应的损失赔偿责任，且“凉安租房”有权采取必要的措施降低各方损失或追究您的责任，包括但不限于暂停向您结算被投诉订单交易款项等。

				您承诺并保证您在凉安租房发布的房源及其中的设施能满足房客的居住用途，且具有安全性、适用性，否则因此导致房客或任意第三方人身、财产损失的，均由您承担责任。

				您应当及时回复房客的咨询、投诉等；

				交易规则（包括订单金额、退订政策的设定），由您自主设定，一经设定，您保证严格执行，否则您将自行承担因此导致的一切经济损失及其他不良后果。

				具体退订政策设定应从下列三种方案中进行选择：

				1、严格退订：入住日期前7天取消预订，退还房客50%的房费；如果未能在7天前取消预订，未住宿天数的房费将不予退还；如果提前退房，未住宿天数的房费将不予退还。

				2、适中退订：入住日期前5天取消预订，退还房客全部房费；如果未能在5天前取消预订，扣除房客首晚房费，及剩余未住宿天数50%的房费。如果提前退房，扣除房客未住宿的首晚房费，及剩余未住宿天数50%的房费。

				3、灵活退订：入住日期前1天取消预订，退还房客全部房费；如果未能在1天前取消预订，扣除房客首晚房费，剩余未住宿天数的房费将全部退还；如果提前退房，扣除房客未住宿的首晚房费，剩余未住宿天数的房费将全部退还。

				第三条 违约责任
				您在凉安租房上发布的房源状态及房价视为您对凉安租房注册用户做出的有房要约，一旦房客通过凉安租房确认预订即为承诺，即生成有效订单，您应对房客履行提供租赁房屋及服务应尽的义务。

				您应及时更新房源状态、租金金额、查收房客预订短信或后台管理系统预订通知并及时回复确认，生成订单且房客成功支付后，您应确保房客的顺利入住以及入住期间的安全，不得擅自变更或取消，在房源信息中有服务承诺的，应履行服务承诺。如您在房客发起预定后12小时内未对订单进行确认或拒绝的，“凉安租房”有权强制取消该订单且有权对您在凉安租房平台上发布的全部或部分房源进行下架处理。

				您单方取消订单（包括但不限于直接取消订单、拒绝为房客办理入住等）会影响房客的计划，属于违约行为，所以您需要承担以下违约责任：

				1）支付取消违约金，您同意凉安租房从您委托凉安租房代收的最近一笔款项中扣除相应取消违约金，取消违约金按照如下规则计收：6个月内1次取消免收取消违约金，6个月内超过1次，每取消1次收取100元的取消违约金。房客入住前1天房东不允许线上取消订单，如确实需要取消订单需要联系凉安租房客服，房东除承担取消违约金外，还须向凉安租房支付相当于房客已经支付的首晚房费金额的违约金；

				2）降低房源排名，凉安租房有权依据您的取消订单率对您的房源排名进行降低；

				3）房源下架，凉安租房有权对您在平台上发布的全部或部分房源进行下架处理；

				4）凉安租房有权将您的取消订单记录写入芝麻信用及自如信用记录。

				如果您认为您的取消行为是由于不可抗力因素导致的（不可抗力因素是指地震、火山、泥石流、战争等您无法预见、无法避免并无法克服的客观情况），则需在取消订单后7日内联系凉安租房客服提出申诉，并按照凉安租房要求提供相关证明，经凉安租房审查确认符合不可抗力情形的，您可免于承担违约责任，凉安租房将退还您已支付的该次取消违约金（如有），重新上架您的房源（如需），撤销您在芝麻信用及自如信用的该次取消记录。

				如因房东原因造成房客不能顺利入住的，应向凉安租房承担相当于房客支付的首晚房费金额的违约金，如仍不足以弥补凉安租房损失的，房东仍应承担其他赔偿责任；如因此给“凉安租房”造成其他损失（包括但不限于“凉安租房”自身损失及向房客承担的赔偿责任）的，房东应承担赔偿责任并同意“凉安租房”从代房东收取的费用中扣除赔偿金。
				如您与房客协商取消订单的，不视为您单方违约。您可自定义退还给房客的房费，房客确认后，您同意凉安租房将按照协商金额处理订单；或在房客同意的前提下，将房客安排至同区域、同星级或更高级别的酒店、民宿，并承担客户原订单中全部首晚房费及其他相关费用（包括但不限于后入住酒店、民宿与原房费差价、交通费、通讯费等）。
				本协议中所称的“房源下架”“下架”是指：该房源所有信息从“凉安租房”上撤销。

				第四条 费用与结算
				（1）费用
				您同意，房客通过平台向您支付的实际消费对应的款项将由凉安租房代您收取。 为了实现房东进入合作平台开展经营活动、进行合同项下交易之目的，凉安租房向您收取服务费用。服务费为租金以及清洁费总和的5％。

				（2）结算方式
				您可以在自如APP民宿房东端中“我的”-“我的账户”-“结算方式”中选择“按订单结算”或“按天结算”，若您选择“按订单结算”则小于7天的订单每单结算1次；大于7天的订单每7天结算1次。若您选择“按天结算”则每天结算1次。

				第五条 禁止刷单行为
				您不得在“凉安租房”平台上进行“刷单”行为。刷单指房东通过非真实交易行为的方式获取积分、礼品卡、体验券、减免返现等平台奖励，或房客以此帮助房东完成平台奖励变现等房东获取经济利益的行为，或房东通过非真实的交易达到套取平台奖励或帮助房客获利的行为。如发现上述情形或者凉安租房有合理怀疑您存在上述情形的（包括但不限于凉安租房自行监测到或接到他人举报、投诉等），凉安租房有权单方终止本协议，拒绝结算存在虚假预订对应的订单金额，并要求责任方赔偿损失。

				第六条 其他
				如您违反上述承诺或本协议、或国家法律、法规等规范文件及“凉安租房”各项规则的规定和要求，或违背社会公共利益或公共道德、损害他人的合法权益，凉安租房有权在发现后将您加入凉安租房“黑名单”（即您不得再次在“凉安租房”上进行信息发布、交易或使用凉安租房其他服务）。

				“凉安租房”有权根据国家法律法规的更新、产品和服务规则的调整需要，不时地制订、变更或修改本协议及（或）其相关各项条款、各类规则。一旦条款内容发生变动，“凉安租房”会在平台上对变更后的条款进行公布，将不再单独通知您。在使用“凉安租房”平台服务时，您有必要对最新的“凉安租房”服务协议条款进行仔细阅读，如您继续使用“凉安租房”服务，即表示您接受已经修订的协议。如您不同意相关变更，应当立即停止使用“凉安租房”的各项服务。经修订的协议一经公布后，立即自动生效。各类规则会在发布后生效，亦成为本协议的一部分，当发生有关争议时，以最新的服务协议为准。

				房东知晓并同意，房客可能在“凉安租房”页面对入住体验进行点评（或评论）。房东有权对点评（或评论）进行回复或解释，但不得使用非法、淫秽、威胁、诽谤、侵犯隐私或以其他形式对房客或第三方构成伤害、侵犯或引起公众反感等不当内容。凉安租房保留清除或编辑这些内容的权利。

				房东在“凉安租房”发布的房源信息和点评（或评论）内容，同意授予“凉安租房”独家的、永久的、免费的在全世界范围内任何媒体上使用、转载、修改、改编、出版、翻译、创作衍生作品、分发和展示这些内容。

				本协议的解释、履行及争议处理均适用中华人民共和国法律。`,
				checked: false
			}
		},
		components: {
			EvanCheckbox
		},
		onLoad() {
			// #ifdef APP-PLUS
			uni.loadFontFace({
				family: 'yueyuan',
				// 本地字体路径需转换为平台绝对路径
				source: `url(${plus.io.convertLocalFileSystemURL('_www/static/yueyuan.otf')})`,
				success() {
					console.log('success')
				},
				fail(e) {
					console.log('fail')
				}
			})
			// #endif 
		},
		methods: {
			fabu() {
				if (this.checked == false) {
					uni.showToast({
						title: "请先阅读协议并勾选！",
						icon: "none"
					})
				} else {
					uni.navigateTo({
						url: '../rentalHouse/rentalHouse'
					})
				}

			}
		}
	}
</script>

<style>
	.title {
		font-family: yueyuan;
		font-size: 50upx;
		font-weight: 700;
		/* margin: 10upx auto;
		width: 50%; */
		text-align: center;
		margin-top: 50upx;
	}

	.xieyi {
		width: 86%;
		border: 1upx dotted #007AFF;
		border-radius: 20upx;
		margin: 50upx auto;
		margin-bottom: 100upx;
		padding: 20upx;
		font-family: yueyuan;
		font-size: 30upx;
		font-weight: 300;
		letter-spacing: 5upx;
	}

	.button {
		z-index: 999999;
		text-align: center;
		position: absolute;
		left: 55%;
		width: 45%;
		transform: translateX(-50%);
		bottom: 118upx;
	}
</style>
